Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: See also [`GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST`](#GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST).
it_it: Vedere anche [`GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST`](#GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST).

source: See also [`INSTANTIATE_TEST_SUITE_P`](#INSTANTIATE_TEST_SUITE_P).
it_it: Vedere anche [`INSTANTIATE_TEST_SUITE_P`](#INSTANTIATE_TEST_SUITE_P).

source: See also [`INSTANTIATE_TYPED_TEST_SUITE_P`](#INSTANTIATE_TYPED_TEST_SUITE_P) and [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) for more information.
it_it: Vedere anche [`INSTANTIATE_TYPED_TEST_SUITE_P`](#INSTANTIATE_TYPED_TEST_SUITE_P) e [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) per ulteriori informazioni.

source: See also [`REGISTER_TYPED_TEST_SUITE_P`](#REGISTER_TYPED_TEST_SUITE_P) and [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) for more information.
it_it: Vedere anche [`REGISTER_TYPED_TEST_SUITE_P`](#REGISTER_TYPED_TEST_SUITE_P) e [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) per ulteriori informazioni.

source: See also [`SCOPED_TRACE`](#SCOPED_TRACE).
it_it: Vedere anche [`SCOPED_TRACE`](#SCOPED_TRACE).

source: See also [`TYPED_TEST_P`](#TYPED_TEST_P) and [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) for more information.
it_it: Vedere anche [`TYPED_TEST_P`](#TYPED_TEST_P) e [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) per ulteriori informazioni.

source: See also [`TYPED_TEST`](#TYPED_TEST) and [Typed Tests](../advanced.md#typed-tests) for more information.
it_it: Vedere anche [`TYPED_TEST`](#TYPED_TEST) and [Typed Tests](../advanced.md#typed-tests) per ulteriori informazioni.

source: See also [`TestParamInfo`](#TestParamInfo) and [`INSTANTIATE_TEST_SUITE_P`](#INSTANTIATE_TEST_SUITE_P).
it_it: Vedere anche [`TestParamInfo`](#TestParamInfo) e [`INSTANTIATE_TEST_SUITE_P`](#INSTANTIATE_TEST_SUITE_P).

source: See also the InSequence class.
it_it: Vedere anche la classe InSequence.

source: See also the ScopedTrace class.
it_it: Vedere anche la classe ScopedTrace.

source: See also the Floating-Point Comparison assertions to compare floating-point numbers and avoid problems caused by rounding.
it_it: Consultare anche le asserzioni di Confronto in Virgola Mobile per confrontare numeri in virgola evitando problemi causati dall'arrotondamento.

source: See also the [Floating-Point Comparison](#floating-point) assertions to compare floating-point numbers and avoid problems caused by rounding.
it_it: Consultare anche le asserzioni di [Confronto in Virgola Mobile](#floating-point) per confrontare numeri in virgola evitando problemi causati dall'arrotondamento.

source: See also the [`InSequence` class](#InSequence).
it_it: Vedere anche la [classe `InSequence`](#InSequence).

source: See also the [`ScopedTrace` class](#ScopedTrace).
it_it: Vedere anche la [classe `ScopedTrace`](#ScopedTrace).

source: See details for EXPECT_PRED* in the Assertions Reference.
it_it: Vedere i dettagli per EXPECT_PRED* nei "Riferimenti sulle Asserzioni"

source: See details for [`EXPECT_PRED*`](reference/assertions.md#EXPECT_PRED) in the Assertions Reference.
it_it: Vedere i dettagli per [`EXPECT_PRED*`](reference/assertions.md#EXPECT_PRED) nei "Riferimenti sulle Asserzioni".

source: See details for each modifier clause below.
it_it: Vedere in seguito i dettagli per ciascuna clausola modificatrice.

source: See more detail below.
it_it: Maggiori dettagli di seguito.

source: See the InSequence clause of EXPECT_CALL for usage.
it_it: Vedere la clausola InSequence di EXPECT_CALL per l'utilizzo.

source: See the WillOnce and WillRepeatedly clauses of EXPECT_CALL.
it_it: Vedere le clausole WillOnce e WillRepeatedly di EXPECT_CALL.

source: See the following example:
it_it: Vedere l'esempio seguente:

source: See the Matchers Reference for a list of all built-in matchers.
it_it: Consultare i Riferimenti ai Matcher per un elenco di tutti i matcher nativi.

source: See the Times clause of EXPECT_CALL in the Mocking Reference.
it_it: Vedere le clausole Times di EXPECT_CALL nela "Guida al Mocking".

source: See the Actions Reference.
it_it: Vedere i Riferimenti alle Action.

source: See the Matchers Reference.
it_it: Vedere i Riferimenti ai Matcher.

source: See the Actions Reference for a list of built-in actions.
it_it: Consultare i Riferimenti alle Action per un elenco delle action native.

source: See the Resources section below for further information.
it_it: Consultare la sezione Risorse di seguito per ulteriori informazioni.

source: See the [Actions Reference](actions.md) for a list of built-in actions.
it_it: Consultare i [Riferimenti alle Action](actions.md) per un elenco delle action native.

source: See the [Actions Reference](reference/actions.md).
it_it: Vedere i [Riferimenti alle Action](reference/actions.md).

source: See the [Matchers Reference](matchers.md) for a list of all built-in matchers.
it_it: Consultare i [Riferimenti ai Matcher](matchers.md) per un elenco di tutti i matcher nativi.

source: See the [Matchers Reference](reference/matchers.md).
it_it: Vedere i [Riferimenti ai Matcher](reference/matchers.md).

source: See the [`InSequence`](#EXPECT_CALL.InSequence) clause of `EXPECT_CALL` for usage.
it_it: Vedere la clausola [`InSequence`](#EXPECT_CALL.InSequence) di `EXPECT_CALL` per l'utilizzo.

source: See the [`Times` clause](reference/mocking.md#EXPECT_CALL.Times) of `EXPECT_CALL` in the Mocking Reference.
it_it: Vedere le [clausole `Times` ](reference/mocking.md#EXPECT_CALL.Times) di `EXPECT_CALL` nella "Guida al Mocking".

source: See the [`WillOnce`](#EXPECT_CALL.WillOnce) and [`WillRepeatedly`](#EXPECT_CALL.WillRepeatedly) clauses of `EXPECT_CALL`.
it_it: Vedere le clausole [`WillOnce`](#EXPECT_CALL.WillOnce) e [`WillRepeatedly`](#EXPECT_CALL.WillRepeatedly) di `EXPECT_CALL`.

source: See the end of this section for details.
it_it: Per i dettagli vedere la fine di questa sezione.

source: See the following example, using the ASSERT_EQ and EXPECT_EQ macros to verify value equality:
it_it: Esaminare l'esempio seguente, utilizzando le macro ASSERT_EQ e EXPECT_EQ per verificare l'uguaglianza dei valori:

source: See the following example, using the [`ASSERT_EQ` and `EXPECT_EQ`](reference/assertions.md#EXPECT_EQ) macros to verify value equality:
it_it: Esaminare l'esempio seguente, utilizzando le macro [`ASSERT_EQ` e `EXPECT_EQ`](reference/assertions.md#EXPECT_EQ) per verificare l'uguaglianza dei valori:

source: See the implementation of Return() in gmock-actions.h for an example.
it_it: Vedere l'implementazione di Return() in gmock-actions.h per un esempio.

source: See the implementation of `Return()` in `gmock-actions.h` for an example.
it_it: Vedere l'implementazione di `Return()` in `gmock-actions.h` per un esempio.

source: See this recipe for more details and an example.
it_it: Vedere questa ricetta per maggiori dettagli e un esempio.

source: See this recipe for one application of it.
it_it: Consultare questa ricetta per una sua applicazione.

source: See this [recipe](gmock_cook_book.md#UsingCheckPoints) for one application of it.
it_it: Consultare questa [ricetta](gmock_cook_book.md#UsingCheckPoints) per una sua applicazione.

source: See this [recipe](gmock_cook_book.md#mocking-side-effects) for more details and an example.
it_it: Vedere questa [ricetta](gmock_cook_book.md#mocking-side-effects) per maggiori dettagli e un esempio.

source: Selecting Between Overloaded Functions {#SelectOverload}
it_it: Scegliere le Funzioni Overloaded {#SelectOverload}

source: Selecting Tests
it_it: Selezione dei Test

source: Selecting an Action's Arguments {#SelectingArgs}
it_it: Selezionare gli Argomenti di un'Azione {#SelectingArgs}

source: Set errno to error and return value.
it_it: Setta errno a error e restituisce value.

source: Set `errno` to `error` and return `value`.
it_it: Setta `errno` a `error` e restituisce `value`.

source: Set expectations on Call() method.
it_it: Imposta le expectation sul metodo Call().

source: Set its default actions and expectations using ON_CALL() and EXPECT_CALL().
it_it: Se ne impostano le azioni e le expectation con ON_CALL() e con EXPECT_CALL().

source: Set its default actions and expectations using `ON_CALL()` and `EXPECT_CALL()`.
it_it: Se ne impostano le azioni e le expectation con `ON_CALL()` e con `EXPECT_CALL()`.

source: Set up a Bazel workspace
it_it: Configurare un workspace Bazel

source: Set up a project
it_it: Preparazione di un progetto

source: Set your expectations on the mock objects (How will they be called?
it_it: Si settano le expectation sugli oggetti mock (Come verranno chiamati?

source: Sets a new value, overriding the previous one.
it_it: Imposta un nuovo valore, sovrascrivendo quello precedente.

source: Sets the call type for the method, for example Calltype(STDMETHODCALLTYPE).
it_it: Imposta il tipo di chiamata per il metodo, ad esempio Calltype(STDMETHODCALLTYPE).

source: Sets the call type for the method, for example `Calltype(STDMETHODCALLTYPE)`.
it_it: Imposta il tipo di chiamata per il metodo, ad esempio `Calltype(STDMETHODCALLTYPE)`.

source: Sets the default verbosity level (info, warning, or error) of Google Mock messages.
it_it: Imposta il livello di verbosità di default (info, warning, o error) dei messaggi di Google Mock.

source: Sets the default verbosity level (`info`, `warning`, or `error`) of Google Mock messages.
it_it: Imposta il livello di verbosità di default (`info`, `warning`, o `error`) dei messaggi di Google Mock.

source: Setting Default Actions {#OnCall}
it_it: Impostazione delle Azioni di Default {#OnCall}

source: Setting Expectations
it_it: Impostare le Expectation

source: Setting Expectations {#ExpectCall}
it_it: Impostare le Expectation {#ExpectCall}

source: Setting expectations after code that exercises the mock has undefined behavior.
it_it: L'impostazione delle expectation dopo il codice che esercita il mock ha un comportamento indefinito.

source: Setting the Default Actions for a Mock Method
it_it: Impostazione delle Azioni di Default per un Metodo Mock

source: Setting the Default Value for a Return Type {#DefaultValue}
it_it: Impostazione del Valore di Default per un Tipo Restituito {#DefaultValue}

source: Sharing Actions
it_it: Condivisione di Azioni

source: Sharing Matchers
it_it: Matcher Condivisi

source: Sharing Resources Between Tests in the Same Test Suite
it_it: Condivisione delle Risorse Tra Test nella Stessa Test Suite

source: She could do that using a wrapper function that throws away the arguments before invoking an underlining nullary function.
it_it: Potrebbe farlo utilizzando una funzione wrapper che elimina gli argomenti prima di invocare una [nullary function].

source: Should I use Invoke() or implement the ActionInterface interface?
it_it: Dovrei usare Invoke() o implementare l'interfaccia ActionInterface?

source: Should I use the constructor/destructor of the test fixture or SetUp()/TearDown()?
it_it: Si usa il costruttore/distruttore della fixture o SetUp()/TearDown()?

source: Should I use typed tests or value-parameterized tests?
it_it: Dovrei utilizzare test tipizzati o test con valori parametrizzati?

source: Shuffling the Tests
it_it: Mischiare i Test

source: Side Effects
it_it: Effetti Collaterali

source: Similar to assertions, GTEST_SKIP allows streaming a custom message into it.
it_it: Similmente alle asserzioni, GTEST_SKIP consente al suo interno lo streaming di un messaggio personalizzato.

source: Similar to assertions, `GTEST_SKIP` allows streaming a custom message into it.
it_it: Similmente alle asserzioni, `GTEST_SKIP` consente al suo interno lo streaming di un messaggio personalizzato.

source: Similarly, HasNonfatalFailure() returns true if the current test has at least one non-fatal failure, and HasFailure() returns true if the current test has at least one failure of either kind.
it_it: Allo stesso modo, HasNonfatalFailure() restituisce true se il test corrente ha almeno un errore non fatale e HasFailure() restituisce true se il test corrente presenta almeno un errore di entrambi i tipi.

source: Similarly, Return(new Foo) will create a new Foo object when the EXPECT_CALL() is executed, and will return the same pointer every time.
it_it: Allo stesso modo, Return(new Foo) creerà un nuovo oggetto Foo quando viene eseguito EXPECT_CALL() e restituirà ogni volta lo stesso puntatore.

source: Similarly, `HasNonfatalFailure()` returns `true` if the current test has at least one non-fatal failure, and `HasFailure()` returns `true` if the current test has at least one failure of either kind.
it_it: Allo stesso modo, `HasNonfatalFailure()` restituisce `true` se il test corrente ha almeno un errore non fatale e `HasFailure()` restituisce `true` se il test corrente presenta almeno un errore di entrambi i tipi.

source: Similarly, `Return(new Foo)` will create a new `Foo` object when the `EXPECT_CALL()` is executed, and will return the same pointer every time.
it_it: Allo stesso modo, `Return(new Foo)` creerà un nuovo oggetto `Foo` quando viene eseguito `EXPECT_CALL()` e restituirà ogni volta lo stesso puntatore.

source: Similarly, if you are matching multiple parameters, it may not be easy to distinguishing which argument failed to match.
it_it: Allo stesso modo, se si c'è il "match" di più parametri, potrebbe non essere facile distinguere quale argomento non è riuscito a corrispondere.

source: Similarly, sometimes people spell SetUpTestSuite() as SetupTestSuite() and wonder why it's never called.
it_it: Allo stesso modo, a volte le persone scrivono SetUpTestSuite() come SetupTestSuite() e si chiedono perché non venga mai chiamato.

source: Similarly, sometimes people spell `SetUpTestSuite()` as `SetupTestSuite()` and wonder why it's never called.
it_it: Allo stesso modo, a volte le persone scrivono `SetUpTestSuite()` come `SetupTestSuite()` e si chiedono perché non venga mai chiamato.

source: Similarly, to use a template function, specify the template arguments:
it_it: Allo stesso modo, per utilizzare una funzione template, specificare gli argomenti template:

source: Simple
it_it: Semplice

source: Simple Tests
it_it: Test Semplici

source: Simple?
it_it: Semplice?

source: Simplifying the Interface without Breaking Existing Code {#SimplerInterfaces}
it_it: Semplificare l'Interfaccia senza Compromettere il Codice Esistente {#SimplerInterfaces}

source: Since EXPECT_CALL does more, isn't it better than ON_CALL?
it_it: Dato che EXPECT_CALL fa di più, non è meglio di ON_CALL?

source: Since FooTest.AbcDeathTest needs to run before BarTest.Xyz, and we don't interleave tests from different test suites, we need to run all tests in the FooTest case before running any test in the BarTest case.
it_it: Poiché FooTest.AbcDeathTest deve essere eseguito prima di BarTest.Xyz, e non interlacciamo test di diverse test suite, dobbiamo eseguire tutti i test nel caso FooTest prima di eseguire qualsiasi test nel caso BarTest.

source: Since LOG messages go to stderr, we decided to let GoogleTest output go to stdout.
it_it: Poiché i messaggi di LOG vanno a stderr, abbiamo deciso di lasciare che l'output di GoogleTest vada a stdout.

source: Since statement runs in the child process, any in-memory side effect (e.g. modifying a variable, releasing memory, etc) it causes will not be observable in the parent process.
it_it: Poiché statement viene eseguito nel processo figlio, qualsiasi effetto collaterale in memoria (ad esempio la modifica di una variabile, il rilascio di memoria, ecc.) da esso causato non sarà osservabile nel processo genitore.

source: Since unique_ptr<> has a default constructor that returns a null unique_ptr, that’s what you’ll get if you don’t specify an action:
it_it: Poiché unique_ptr<> ha un costruttore di default che restituisce un unique_ptr nullo, questo è ciò che si ottiene se non si specifica un'azione:

source: Since GoogleTest is based on the popular xUnit architecture, you'll feel right at home if you've used JUnit or PyUnit before.
it_it: Dat che GoogleTest è basato sulla popolare architettura xUnit, ci si sentirà come a casa se si è già utenti di JUnit o di PyUnit.

source: Since `EXPECT_CALL` does more, isn't it better than `ON_CALL`?
it_it: Dato che `EXPECT_CALL` fa di più, non è meglio di `ON_CALL`?

source: Since `FooTest.AbcDeathTest` needs to run before `BarTest.Xyz`, and we don't interleave tests from different test suites, we need to run all tests in the `FooTest` case before running any test in the `BarTest` case.
it_it: Poiché `FooTest.AbcDeathTest` deve essere eseguito prima di `BarTest.Xyz`, e non interlacciamo test di diverse test suite, dobbiamo eseguire tutti i test nel caso `FooTest` prima di eseguire qualsiasi test nel caso `BarTest`.

source: Since `LOG` messages go to stderr, we decided to let GoogleTest output go to stdout.
it_it: Poiché i messaggi di `LOG` vanno a stderr, abbiamo deciso di lasciare che l'output di GoogleTest vada a stdout.

source: Since `statement` runs in the child process, any in-memory side effect (e.g. modifying a variable, releasing memory, etc) it causes will *not* be observable in the parent process.
it_it: Poiché `statement` viene eseguito nel processo figlio, qualsiasi effetto collaterale in memoria (ad esempio la modifica di una variabile, il rilascio di memoria, ecc.) da esso causato *non* sarà osservabile nel processo genitore.

source: Since `unique_ptr<>` has a default constructor that returns a null `unique_ptr`, that’s what you’ll get if you don’t specify an action:
it_it: Poiché `unique_ptr<>` ha un costruttore di default che restituisce un `unique_ptr` nullo, questo è ciò che si ottiene se non si specifica un'azione:

source: Since a failed ASSERT_* returns from the current function immediately, possibly skipping clean-up code that comes after it, it may cause a space leak.
it_it: Poiché un ASSERT_* non riuscito ritorna immediatamente dalla funzione corrente, probabilmente saltando il codice di pulizia successivo, potrebbe causare dei "memory leak".

source: Since a failed `ASSERT_*` returns from the current function immediately, possibly skipping clean-up code that comes after it, it may cause a space leak.
it_it: Poiché un `ASSERT_*` non riuscito ritorna immediatamente dalla funzione corrente, probabilmente saltando il codice di pulizia successivo, potrebbe causare dei "memory leak".

source: Since making a parameter const is meaningless in the method declaration, we recommend to remove it in both Foo and MockFoo.
it_it: Poiché la creazione di un parametro const non ha significato nella dichiarazione del metodo, consigliamo di rimuoverlo sia in Foo che in MockFoo.

source: Since making a parameter `const` is meaningless in the method declaration, we recommend to remove it in both `Foo` and `MockFoo`.
it_it: Poiché la creazione di un parametro `const` non ha significato nella dichiarazione del metodo, consigliamo di rimuoverlo sia in `Foo` che in `MockFoo`.

source: Since most STL containers support the == operator, you can write Eq(expected_container) or simply expected_container to match a container exactly.
it_it: Poiché la maggior parte dei container STL supportano l'operatore ==, si può scrivere Eq(expected_container) o semplicemente expected_container per verificare esattamente un container.

source: Since most STL containers support the `==` operator, you can write `Eq(expected_container)` or simply `expected_container` to match a container exactly.
it_it: Poiché la maggior parte dei container STL supportano l'operatore `==`, si può scrivere `Eq(expected_container)` o semplicemente `expected_container` per verificare esattamente un container.

source: Since that format was originally intended for Java, a little interpretation is required to make it apply to GoogleTest tests, as shown here:
it_it: Poiché tale formato era originariamente previsto per Java, è necessaria una piccola interpretazione per applicarlo ai test di GoogleTest, come mostrato qui:

source: Since the order is important here, we should make it explicit using a sequence:
it_it: Poiché in questo caso l'ordine è importante, dovremmo renderlo esplicito utilizzando una sequenza:

source: Since the functions are not virtual and the two classes are unrelated, you must specify your choice at compile time (as opposed to run time).
it_it: Dato che le funzioni non sono virtuali e le due classi non sono correlate, si deve specificare la scelta in fase di compilazione (invece che in fase di esecuzione [run time]).

source: Since the functions are not virtual and the two classes are unrelated, you must specify your choice at *compile time* (as opposed to run time).
it_it: Dato che le funzioni non sono virtuali e le due classi non sono correlate, si deve specificare la scelta in *fase di compilazione* (invece che in fase di esecuzione [run time]).

source: Since the statically initialized GoogleTest singleton requires allocations on the heap, the Visual C++ memory leak detector will report memory leaks at the end of the program run.
it_it: Poiché il singleton GoogleTest inizializzato staticamente richiede allocazioni nell'heap, il rilevatore di memory leak di Visual C++ segnalerà le perdite di memoria alla fine dell'esecuzione del programma.

source: Since these precondition checks cause the processes to die, we call such tests death tests.
it_it: Poiché questi controlli sulle precondizioni causano la morte dei processi, questi test si chiamano death test.

source: Since these precondition checks cause the processes to die, we call such tests _death tests_.
it_it: Poiché questi controlli sulle precondizioni causano la morte dei processi, questi test si chiamano _death tests_.

source: Since we are inside a derived class template, C++ requires
it_it: Poiché ci troviamo all'interno di una classe template derivata, il C++ ci richiede

source: Since we are just relying on the constructor and destructor of this object to do the actual work, its name is really irrelevant.
it_it: Dato che facciamo affidamento solo sul costruttore e sul distruttore di questo oggetto per svolgere il lavoro vero e proprio, il suo nome è davvero irrilevante.

source: Since you can build complex matchers from simpler ones easily using gMock, this gives you a way to conveniently construct composite predicates (doing the same using STL's <functional> header is just painful).
it_it: Dal momento che si possono creare facilmente matcher complessi da quelli più semplici utilizzando gMock, questo fornisce un modo per costruire comodamente predicati compositi (fare lo stesso usando l'header <functional> di STL è semplicemente complicato).

source: Since you can build complex matchers from simpler ones easily using gMock, this gives you a way to conveniently construct composite predicates (doing the same using STL's `<functional>` header is just painful).
it_it: Dal momento che si possono creare facilmente matcher complessi da quelli più semplici utilizzando gMock, questo fornisce un modo per costruire comodamente predicati compositi (fare lo stesso usando l'header `<functional>` di STL è semplicemente complicato).

source: Since you own FooAdaptor, you can absorb changes in Foo much more easily.
it_it: Poiché si è proprietari di FooAdaptor, si possono assorbire più facilmente le modifiche in Foo.

source: Since you own `FooAdaptor`, you can absorb changes in `Foo` much more easily.
it_it: Poiché si è proprietari di `FooAdaptor`, si possono assorbire più facilmente le modifiche in `Foo`.

source: Since you're overriding a virtual method, we suggest adding the override keyword.
it_it: Poiché si sta sovrascrivendo [overriding] un metodo virtuale, suggeriamo di aggiungere la parola chiave override.
